import sqlite3 as sq


def find_bal_risk():  # выбираем из базы данных последние строки по этому пользователю
    with sq.connect('/home/ilib/PycharmProjects/221210_PTO/anketa_pto.db') as base:
        cur = base.cursor()
        cur.execute('SELECT * FROM menu ORDER BY user_id DESC LIMIT 1')
        rows = cur.fetchall()
        for i in rows:
            row = i

    bal = 0
    q_1 = row[2]  # сколько Вам полных лет
    if q_1 <= 19 or 46 <= q_1 <= 50:
        bal += 2
    elif 20 <= q_1 <= 45:
        bal += 1
    else:
        bal += 3

    q_2 = row[3]  # начались менструации
    if q_2 < 12:
        bal += 1
    elif 12 <= q_2 < 15:
        bal += 0
    else:
        bal += 2

    q_3 = row[4]  # прекратились менструации
    if q_3 < 40:
        bal += 2
    elif 40 <= q_3 <= 45:
        bal += 0
    elif 46 <= q_3 <= 50:
        bal += 1
    else:
        bal += 3

    q_4 = row[5]  # выпадение половых органов и грыжи
    if q_4 == 'Нет пролапса':
        bal += 0
    elif q_4 == 'У матери':
        bal += 2
    else:
        bal += 1

    q_5 = row[6]  # Астенический тип телосложения
    if q_5 == "Да":
        bal += 1
    else:
        bal += 0

    q_6 = row[7]  # Отсутствие стрий на коже
    if q_6 == "Да":
        bal += 1
    else:
        bal += 0

    q_7 = row[8]  # Нарушение рефракции
    if q_7 == "Да":
        bal += 1
    else:
        bal += 0

    q_8 = row[9]  # Мышечная гипотония
    if q_8 == "Да":
        bal += 1
    else:
        bal += 0

    q_9 = row[10]  # Уплощение свода стопы
    if q_9 == "Да":
        bal += 1
    else:
        bal += 0

    q_10 = row[11]  # Склонность к легкому образованию синяков
    if q_10 == "Да":
        bal += 1
    else:
        bal += 0

    q_11 = row[12]  # Кровотечение в послеродовом периоде
    if q_11 == "Да":
        bal += 1
    else:
        bal += 0

    q_12 = row[13]  # Вегето-сосудистые дисфункции
    if q_12 == "Да":
        bal += 1
    else:
        bal += 0

    q_13 = row[14]  # Нарушение сердечного ритма и проводимости
    if q_13 == "Да":
        bal += 1
    else:
        bal += 0

    q_14 = row[15]  # Сколиоз, кифоз, кифосколиоз
    if q_14 == "Да":
        bal += 2
    else:
        bal += 0

    q_15 = row[16]  # Плоскостопие 2-3 степени
    if q_15 == "Да":
        bal += 2
    else:
        bal += 0

    q_16 = row[17]  # Эластоз кожи
    if q_16 == "Да":
        bal += 2
    else:
        bal += 0

    q_17 = row[18]  # Гиперподвижность суставов
    if q_17 == "Да":
        bal += 2
    else:
        bal += 0

    q_18 = row[19]  # Склонность к аллергическим реакциям
    if q_18 == "Да":
        bal += 2
    else:
        bal += 0

    q_19 = row[20]  # Варикозная болезнь, геморрой
    if q_19 == "Да":
        bal += 2
    else:
        bal += 0

    q_20 = row[21]  # Дискинезия желчевыводящих путей
    if q_20 == "Да":
        bal += 2
    else:
        bal += 0

    q_21 = row[22]  # Нарушение эвакуационной функции ЖКТ
    if q_21 == "Да":
        bal += 2
    else:
        bal += 0

    q_22 = row[23]  # Угроза преждевременных родов на сроке 32 - 35 недель беременности
    if q_22 == "Да":
        bal += 2
    else:
        bal += 0

    q_23 = row[24]  # стремительные роды
    if q_23 == "Да":
        bal += 2
    else:
        bal += 0

    q_24 = row[25]  # Пролапс гениталий или грыжи у родственников первой линии
    if q_24 == "Да":
        bal += 2
    else:
        bal += 0

    q_25 = row[26]  # Грыжи
    if q_25 == "Да":
        bal += 3
    else:
        bal += 0

    q_26 = row[27]  # Спланхноптоз
    if q_26 == "Да":
        bal += 3
    else:
        bal += 0

    q_27 = row[28]  # Варикозная болезнь
    if q_27 == "Да":
        bal += 3
    else:
        bal += 0

    q_28 = row[29]  # Привычные вывихи суставов
    if q_28 == "Да":
        bal += 3
    else:
        bal += 0

    q_29 = row[30]  # Нарушения моторной функции ЖКТ
    if q_29 == "Да":
        bal += 3
    else:
        bal += 0

    q_30 = row[31]  # Дивертикулы, долихосигма
    if q_30 == "Да":
        bal += 3
    else:
        bal += 0

    q_31 = row[32]  # Поливалентная аллергия
    if q_31 == "Да":
        bal += 3
    else:
        bal += 0

    q_32 = row[33]  # Количество родов
    if q_32 == 'Не рожала':
        bal += 0
    elif q_32 == '1':
        bal += 1
    elif q_32 == '2':
        bal += 2
    else:
        bal += 3

    q_33 = row[34]  # Возраст первых родов:
    if q_33 < 20 or 26 <= q_33 <= 30:
        bal += 1
    elif 21 <= q_33 <= 25:
        bal += 0
    else:
        bal += 2

    q_34 = row[35]  # q_34 масса тела
    q_35 = row[36]  # q_35 рост
    imt = float(q_34 / (q_35 / 100) ** 2)  # ИМТ
    if imt < 18.5 or 25.0 <= imt <= 30.0:
        bal += 1
    elif 18.5 <= imt <= 24.9:
        bal += 0
    else:
        bal += 2

    q_36 = row[37]  # Потребление алкоголя
    if q_36 == 'Не потребляю':
        bal += 0
    elif q_36 == 'Потребляла ранее':
        bal += 1
    else:
        bal += 2

    q_37 = row[38]  # Табакокурение
    if q_37 == 'Нет, не курю':
        bal += 0
    elif q_37 == 'Ранее курила, потом бросила':
        bal += 1
    else:
        bal += 2

    q_38 = row[39]  # Образ жизни
    if q_38 == 'Нормальный':
        bal += 0
    elif q_38 == 'Малоподвижный':
        bal += 1
    else:
        bal += 2

    q_39 = row[40]  # Масса плода
    if q_39 < 3000:
        bal += 1
    elif 3000 <= q_39 <= 3500:
        bal += 2
    else:
        bal += 3

    q_40 = row[41]  # Травмы промежности
    if q_40 == 'Да':
        bal += 1
    elif q_40 == 'Нет':
        bal += 0
    else:
        bal += 2

    q_41 = row[42]  # Акушерские операции
    if q_41 == 'Да':
        bal += 1
    elif q_41 == 'Нет':
        bal += 0
    else:
        bal += 2

    q_42 = row[43]  # Расстройства функции тазовых органов
    if q_42 == 'Да':
        bal += 1
    else:
        bal += 0

    q_43 = row[44]  # Экстрагенитальные заболевания во время беременности
    if q_43 == 'Да':
        bal += 1
    else:
        bal += 0

    q_44 = row[45]  # Преждевременные роды
    if q_44 == 'Да':
        bal += 1
    else:
        bal += 0

    q_45 = row[46]  # Воспалительные заболевания половых органов
    if q_45 == 'Да':
        bal += 1
    else:
        bal += 0

    q_46 = row[47]  # Доброкачественные заболевания половых органов
    if q_46 == 'Да':
        bal += 1
    else:
        bal += 0

    q_47 = row[48]  # Оперативные вмешательства
    if q_47 == 'Да':
        bal += 1
    else:
        bal += 0

    q_48 = row[49]  # Травмы органов малого таза.
    if q_48 == 'Да':
        bal += 1
    else:
        bal += 0

    q_49 = row[50]  # Операции на наружных половых и тазовых органов
    if q_49 == 'Да':
        bal += 1
    else:
        bal += 0

    q_50 = row[51]  # Заболевания эндокринной системы
    if q_50 == 'Да':
        bal += 1
    else:
        bal += 0

    q_51 = row[52]  # Заболевания органов дыхания
    if q_51 == 'Да':
        bal += 1
    else:
        bal += 0

    q_52 = row[53]  # Заболевания мочевыделительной системы
    if q_52 == 'Да':
        bal += 1
    else:
        bal += 0

    q_53 = row[54]  # Заболевания сердечно сосудистой системы
    if q_53 == 'Да':
        bal += 1
    else:
        bal += 0

    q_54 = row[55]  # Заболевания желудочно- кишечного тракта
    if q_54 == 'Да':
        bal += 1
    else:
        bal += 0

    q_55 = row[56]  # Заболевания органов зрения
    if q_55 == 'Да':
        bal += 1
    else:
        bal += 0

    q_56 = row[57]  # Заболевания нервной системы
    if q_56 == 'Да':
        bal += 1
    else:
        bal += 0

    q_57 = row[58]  # Заболевания системы крови
    if q_57 == 'Да':
        bal += 1
    else:
        bal += 0

    q_58 = row[59]  # Костно-мышечные заболевания
    if q_58 == 'Да':
        bal += 1
    else:
        bal += 0

    q_59 = row[60]  # Патология зубочелюстной системы
    if q_59 == 'Да':
        bal += 1
    else:
        bal += 0

    q_60 = row[61]  # Перенесенные полостные операци
    if q_60 == 'Да':
        bal += 1
    else:
        bal += 0

    q_61 = row[62]  # Другие не полостные операции
    if q_61 == 'Да':
        bal += 1
    else:
        bal += 0

    q_62 = row[63]  # Расстройства мочеиспускания
    if q_62 == 'Да':
        bal += 1
    else:
        bal += 0

    q_63 = row[64]  # Нарушения дефекации
    if q_63 == 'Да':
        bal += 1
    else:
        bal += 0

    q_64 = row[65]  # Нарушения половой функции
    bal += q_64

    q_65 = row[66]  # Продолжительность расстройств функции тазовых органов
    if q_65 <= 5:
        bal += 1
    elif 6 <= q_65 <= 10:
        bal += 2
    else:
        bal += 3

#
    if 1 < bal <= 17:
        y = 'низкая'
    elif 18 <= bal <= 35:
        y = 'средняя'
    else:
        y = 'высокая'

    return y, bal


# a = find_bal_risk()
# print(a)
# stepen = a[0]
# bal = a[1]
# print('Степень -', stepen)
# print('Количество баллов =', bal)
